# datetime 模块是 Python 标准库中的一个模块，用于处理日期和时间相关的操作。
# 它提供了各种类和函数，用于创建、操作和格式化日期时间对象，并进行日期时间计算、比较和格式化。

"""
下面是 datetime 模块中一些常用的类和函数：

datetime 类：表示日期和时间的对象。它可以表示年、月、日、时、分、秒和微秒，并提供了各种方法用于操作和格式化日期时间。
date 类：表示日期的对象。它包含年、月和日，并提供了方法用于日期的计算、比较和格式化。
time 类：表示时间的对象。它包含时、分、秒和微秒，并提供了方法用于时间的计算、比较和格式化。
timedelta 类：表示时间间隔的对象。它可以表示一段时间的差异，如天数、秒数、微秒数等，用于日期时间的加减操作和计算。
strftime() 函数：用于将日期时间对象格式化为字符串。
strptime() 函数：用于将字符串解析为日期时间对象。
today() 函数：返回当前日期的 datetime 对象。
now() 函数：返回当前日期和时间的 datetime 对象。
utcnow() 函数：返回当前的 UTC 日期和时间的 datetime 对象

"""