"""
1. 引用  在python中值是靠引用来传递的
我们可以用id()来判断两个变量是否为同一个值的引用, 我们可以将id值理解为那块内存地址的标识

"""

a = 1
b = a
c = a

print(id(a))  # 2574516551920
print(id(b))  # 2574516551920
print(id(c))  # 2574516551920

del a  # 删掉a, b和c仍然指向那块地址
print(id(b))  # 2574516551920
print(id(c))  # 2574516551920


"""
2. 函数参数的引用
"""

# 1. 针对不可变类型 int  str  float  bool  tuple
# 其值更新, 其内存地址也会更新
def test1(i):
    i += 1


n1 = 9
# 传入参数n1, 此时n1和i都指向9所在的内存, 当i进行变化时, i变成10, 就指向10所在的内存
test1(n1)
# n1指向的内存并没有受影响, 所以输出的结果不变
print(n1)  # 9


# 2. 针对可变类型  list dict set
# 其值更新, 其内存地址不会更新


def test2(li):
    li.pop()


list2 = [1, 2, 3, 4]
# 传入参数list2, 此时list2和li都指向同一内存, 当li进行变化时, 还是在同一内存变化
test2(list2)
# 所以list2指向的内存也会变化, 输出结果发生改变
print(list2)  # [1, 2, 3]










